cfd/GEO_B/0/U
FoamFile { version 2.0; format ascii; class volVectorField; object U; }
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0.9 0 0);
boundaryField
{
 AIR_INLET { type pressureInletOutletVelocity; value uniform (0.9 0 0); }
 AIR_OUTLET { type pressureInletOutletVelocity; value uniform (2.8 0 0); }
 WALLS { type noSlip; }
}
