cfd/GEO_B/0/epsilon
FoamFile { version 2.0; format ascii; class volScalarField; object epsilon; }
dimensions [0 2 -3 0 0 0 0];
internalField uniform 0.000834;
boundaryField
{
    AIR_INLET { type fixedValue; value uniform 0.000834; }
    AIR_OUTLET { type inletOutlet; inletValue uniform 0.000834; value uniform 0.000834; }
    WALLS { type epsilonWallFunction; value uniform 0.000834; }
}
