cfd/GEO_B/0/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.00375;
boundaryField
{
    AIR_INLET { type fixedValue; value uniform 0.00375; }
    AIR_OUTLET { type inletOutlet; inletValue uniform 0.00375; value uniform 0.00375; }
    WALLS { type kqRWallFunction; value uniform 0.00375; }
}
